Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/tutorial.tmx
Source language: en
Languages: pl

source: Whetting Your Appetite
pl: Na zaostrzenie apetytu

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
pl: Jeśli dużo pracujesz na komputerach, w końcu zauważysz że są pewne czynności które wolałbyś zautomatyzować. Np., możesz życzyć sobie wykonania przeszukania i zamiany na dużej ilości plików tekstowych, lub zmiany nazwy i przemieszczenia garści plików fotografii w skomplikowany sposób. Być może chciałbyś napisać małą bazę danych do specjalnych zastosowań, lub wyspecjalizowaną aplikację graficznego interfejsu użytkownika, lub prostą grę.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
pl: Jeśli jesteś zawodowym twórcą oprogramowania, możesz mieć potrzebę pracy z kilkoma bibliotekami C/C++/Java ale odkryć że tradycyjny cykl pisania/kompilacji/testowania/ponownej-kompilacji jest zbyt wolny. Być może piszesz zestaw testów dla takiej biblioteki i odkryłeś że pisanie kodu testującego jest nużącym zajęciem. Lub może napisałeś program któremu przydałby się rozszerzający go język, a nie chcesz projektować i realizować całego nowego języka dla swojego programu.

source: Python is just the language for you.
pl: Pyton jest właśnie językiem dla ciebie.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, Mac OS X, and Unix operating systems, and will help you get the job done more quickly.
pl: Mógłbyś napisać skrypt powłoki systemu Unix lub kilka plików wsadowych systemu Windows dla niektórych z tych zadań, ale skrypty powłoki są najlepsze w przenoszeniu plików i zamianie danych tekstowych, a niezbyt dopasowane do graficznych interfejsów użytkownika czy gier. Mógłbyś napisać program w języku C/C++ czy Java, ale zabrałoby to dużo czasu przeznaczonego na rozwój aby otrzymać nawet pierwszy szkic programu. Język Pyton jest prostszy w użyciu, dostępny w systemach operacyjnych Windows, Mac OS X, i Unix, i pomoże ci szybciej załatwić sprawę.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
pl: Język Pyton jest prosty w użyciu, ale jest językiem programowania z prawdziwego zdarzenia, oferującym dużo więcej możliwości konstrukcji i wsparcia dla dużych programów niż to co skrypty powłoki lub pliki wsadowe mogą zaproponować. Z drugiej strony, język Pyton oferuje też dużo więcej sprawdzania błędów niż język C, i, będąc *językiem bardzo wysokiego poziomu*, posiada wbudowane typy danych wysokiego poziomu, takie jak elastyczne tablice i słowniki. Z uwagi na swoje bardziej ogólne typy danych język Pyton stosuje się do dużo szerszej dziedziny problemów niż np. język Awk lub nawet w język Perl, a jednak wiele rzeczy jest co najmniej tak proste w języku Pyton jak w tych językach.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
pl: język Pyton pozwoli ci na to abyś podzielił swój program na moduły, które mogą być ponownie użyte w innych programach języka Pyton. Jest on dostarczony ze sporą kolekcją typowych modułów, których można użyć jako podstawy swoich programów --- lub jako przykładów aby zacząć uczyć się programowania w języku Pyton. Niektóre z tych modułów zapewniają załatwienie spraw takich, jak operacje wejścia/wyjścia na pliku, wywołania systemowe, gniazda, a nawet dostęp do zestawów narzędziowych, reprezentacji graficznego środowiska użytkownika, takich jak Tk.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
pl: Język Pyton jest językiem tłumaczonym, co może oszczędzić ci znacze ilości czasu w trakcie konstruowania programu, gdyż żadna kompilacja ani łączenie nie jest konieczne. Program tłumaczący może być używany w trybie współpracy użytkownika z komputerem, co sprawia że łatwo jest prowadzić doświadczenia z własnościami języka, pisać próbne programy, lub testować podprogramy podczas wstępującego rozwoju programu. Jest także poręcznym biurkowym kalkulatorem.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
pl: Język Pyton pozwala na pisanie programów w sposób zwarty i czytelny. Programy napisane w języku Pyton są zwykle dużo krótsze niż odpowiadające im programy napisane w językach C, C++, czy Java, z kilku powodów:

source: the high-level data types allow you to express complex operations in a single statement;
pl: rodzaje informacji wysokiego poziomu pozwalają na wyrażenie złożonych operacji w pojedynczej instrukcji;

source: statement grouping is done by indentation instead of beginning and ending brackets;
pl: łączenie w grupy instrukcji jest osiągane za pomocą wcięć zamiast nawiasów rozpoczynających i kończących;

source: no variable or argument declarations are necessary.
pl: żadne deklaracje zmiennych czy argumentów nie są wymagane.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
pl: Język Python jest *rozszerzalny*: jeśli wiesz jak programować w języku C, łatwo jest dodać nową wbudowaną funkcję lub moduł do tłumacza, zarówno aby wykonać istotne operacje z maksymalną szybkością, jak też aby skojarzyć programy języka Python z bibliotekami, które mogą być dostępne jedynie w postaci binarnej w kodzie maszynowym (takimi jak biblioteka graficzna pochodząca od szczególnego dostawcy). Gdy już się na prawdę wciągniesz, możesz skojarzyć program tłumaczący język Python z aplikacją napisaną w języku C i użyć go jako rozszerzenia lub języka komend dla tej aplikacji.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
pl: Przy okazji, język przyjął imię od tytułu satyry kanału BBC "Latający Cyrk Monty Pythona" i nie ma nic wspólnego z gadami. Odniesienia do skeczy Monty Pythona w dokumentacji są nie tylko dozwolone, ale też oczekiwane!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
pl: Teraz, gdy już język Python został Ci przedstawiony, będziesz chciał wypróbować go na odrobinę wyższym poziomie szczegółów. Ponieważ najlepszym sposobem uczenia się języka jest używanie go, ten samouczek poleca pobawić się interpreterem języka Python w trakcie dalszej lektury.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
pl: W następnym rozdziale, zostanie wyjaśniona mechanika używania tłumacza. To są raczej niezbyt wyszukane informacje, ale niezbędne dla wypróbowania przykładów pokazanych później.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
pl: Reszta poradnika wprowadza różnorakie własności języka pytonowskiego i podprogramy za pomocą przykładów, począwszy od prostych wyrażeń, poleceń i rodzajów wiadomości, poprzez zadania i zbiory zadań i uogólnień, kończąc na wyjaśnieniu kwestii trudniejszych, takich, jak sytuacje wyjątkowe i określone przez użytkownika uogólnienia.

source: Classes
pl: Uogólnienia

source: Python's class mechanism adds classes to the language with a minimum of new syntax and semantics. It is a mixture of the class mechanisms found in C++ and Modula-3. As is true for modules, classes in Python do not put an absolute barrier between definition and user, but rather rely on the politeness of the user not to "break into the definition." The most important features of classes are retained with full power, however: the class inheritance mechanism allows multiple base classes, a derived class can override any methods of its base class or classes, and a method can call the method of a base class with the same name. Objects can contain an arbitrary amount of data.
pl: Mechanizm klas języka Python dodaje klasy jako składnik języka przy użyciu minimalnej ilości nowej składni i wyrażeń. Jest mieszanką mechanizmów klas z języka C++ i Modula-3. Zarówno jak w przypadku modułów, klasy w języku Python nie stwarzają bezwarunkowej bariery między definicją klasy a użytkownikiem, ale raczej polegają na grzecznym nie "wdzieraniu się do definicji klasy" przez użytkownika. Jednak najważniejsze własności klas są zachowane w pełnej mocy: mechanizm dziedziczenia klas pozwala na wielokrotne klasy bazowe, klasa pochodna może narzucać własne wersje wykonania dowolnych metod klasy lub klas bazowych, a metody mogą odwoływać się do metod o tej samej nazwie, pochodzących z klasy bazowej. Obiekty mogą zawierać dowolnie wybraną ilość danych.

source: In C++ terminology, normally class members (including the data members) are *public* (except see below :ref:`tut-private`), and all member functions are *virtual*. As in Modula-3, there are no shorthands for referencing the object's members from its methods: the method function is declared with an explicit first argument representing the object, which is provided implicitly by the call. As in Smalltalk, classes themselves are objects. This provides semantics for importing and renaming. Unlike C++ and Modula-3, built-in types can be used as base classes for extension by the user. Also, like in C++, most built-in operators with special syntax (arithmetic operators, subscripting etc.) can be redefined for class instances.
pl: W terminologii języka C++, elementy klasy normalnie (włączając elementy danych) są *publiczne* (z wyjątkiem zob. poniżej :ref:`tut-private`), a wszystkie funkcje składowe są *wirtualne*. Tak, jak w języku Modula-3, nie ma żadnych skrótów pozwalających na odwołania do elementów składowych obiektu z wnętrza jego metod: funkcja metody zawiera jawnie zadeklarowany pierwszy argument reprezentujący obiekt, który jest dostarczany niejawnie przy wywołaniu. Tak jak w języku Smalltalk, klasy same w sobie są obiektami. To dostarcza środków wyrazu dla importowania i zmiany nazewnictwa. W przeciwieństwie do języka C++ i języka Modula-3, typy wbudowane mogą być użyte jako klasy bazowe dla rozszerzania przez użytkownika. Także, podobnie jak w języku C++, znaczenie większości wbudowanych operatorów, o specjalnej składni (operatory arytmetyczne, indeksowe itp.) może być na nowo określone dla instancji danej klasy.

source: (Lacking universally accepted terminology to talk about classes, I will make occasional use of Smalltalk and C++ terms. I would use Modula-3 terms, since its object-oriented semantics are closer to those of Python than C++, but I expect that few readers have heard of it.)
pl: (Nie posiadając jednogłośnie przyjętej terminologii do opisu klas, będę okazjonalnie korzystał z określeń właściwych językowi Smalltalk i językowi C++. Byłbym używał okrośleń właściwych językowi Modula 3, ponieważ jego wyrażenia związane z programowaniem obiektowym są bliższe użytym w języku Python, niż w języku C++, ale spodziewam się że niewielu czytających te słowa słyszało o nim.)

source: A Word About Names and Objects
pl: Słowo o nazwach i obiektach

source: Objects have individuality, and multiple names (in multiple scopes) can be bound to the same object. This is known as aliasing in other languages. This is usually not appreciated on a first glance at Python, and can be safely ignored when dealing with immutable basic types (numbers, strings, tuples). However, aliasing has a possibly surprising effect on the semantics of Python code involving mutable objects such as lists, dictionaries, and most other types. This is usually used to the benefit of the program, since aliases behave like pointers in some respects. For example, passing an object is cheap since only a pointer is passed by the implementation; and if a function modifies an object passed as an argument, the caller will see the change --- this eliminates the need for two different argument passing mechanisms as in Pascal.
pl: Obiekty mają pojedynczą tożsamość, ale różne nazwy (w różnych zakresach widoczności) mogą być związane z tym samym obiektem. Jest to określane w innych językach jako występowanie pod różnymi nazwami (aliasowanie). Ta własność zwykle nie jest doceniana w języku Python przy pierwszym spojrzeniu, i może bez szkody pozostać niezauważona przy operowaniu na niezmiennych podstawowych typach (liczbach, ciągach znaków, krotkach). Jednak występowanie pod różnymi nazwami ma potencjalnie zadziwiający wpływ na wyrażenia zakodowane w języku Python dotyczące zmiennych obiektów takich jak listy, słowniki, i większość innych typów. Jest to zwykle używane na korzyść programiu, gdyż zamienne nazwy zachowują się jak wskaźniki pod niektórymi względami. Na przykład, przekazanie obiektu nie jest kosztowne gdyż tylko wskaźnik jest przekazywany w praktycznej realizacji języka; i jeśli funkcja modyfikuje obiekt przekazywany przez argument, wywołujący funkcję zobaczy zmianę --- to eliminuje potrzebę istnienia dwóch różnych mechanizmów przekazywania argumentów takich jak w języku Pascal.

source: Python Scopes and Namespaces
pl: Zakresy widoczności języka Python i przestrzenie nazw

source: Before introducing classes, I first have to tell you something about Python's scope rules. Class definitions play some neat tricks with namespaces, and you need to know how scopes and namespaces work to fully understand what's going on. Incidentally, knowledge about this subject is useful for any advanced Python programmer.
pl: Przed wprowadzaniem klas, najpierw muszę powiedzieć Ci coś o zasadach zakresów widoczności języka Python. Definicje klas płatają figle z przestrzeniami nazw, i trzeba żebyś wiedział, jak zakresy widoczności i przestrzenie nazw działają dla pełnego zrozumienia co się dzieje. Nawiasem mówiąc, wiedza na ten temat jest przydatna każdemu dokonującemu postępów programiście języka Python.

source: Let's begin with some definitions.
pl: Zacznijmy od pewnych ustaleń.

source: A *namespace* is a mapping from names to objects. Most namespaces are currently implemented as Python dictionaries, but that's normally not noticeable in any way (except for performance), and it may change in the future. Examples of namespaces are: the set of built-in names (functions such as :func:`abs`, and built-in exception names); the global names in a module; and the local names in a function invocation. In a sense the set of attributes of an object also form a namespace. The important thing to know about namespaces is that there is absolutely no relation between names in different namespaces; for instance, two different modules may both define a function ``maximize`` without confusion --- users of the modules must prefix it with the module name.
pl: *Przestrzeń nazw* jest przyporządkowaniem nazw do obiektów. Większość przestrzeni nazw jest obecnie praktycznie zrealizowanych jako słowników języka Python, ale zasadniczo nie jest to dostrzegalne w żaden sposób (z wyjątkiem wydajności), i może się zmienić w przyszłości. Przykładami przestrzeni nazw są: zbiór wbudowanych nazw (funkcje takie jak :func:`abs`, i wbudowane nazwy wyjątków); nazwy zadeklarowane nadrzędnie w module; i nazwy lokalne w wywołaniu funkcji. W pewnym sensie zbiór atrybutów obiektu także tworzy przestrzeń nazw. O przestrzeniach nazw warto wiedzieć to, że nie ma całkowicie żadnego związku pomiędzy nazwami w różnych przestrzeniach nazw; na przykład, dwa różne moduły mogą równocześnie określać funkcję ``maksymalizuj`` bez niejasności --- użytkownicy modułów muszą poprzedzić ją za pomocą nazwy modułu.

source: By the way, I use the word *attribute* for any name following a dot --- for example, in the expression ``z.real``, ``real`` is an attribute of the object ``z``. Strictly speaking, references to names in modules are attribute references: in the expression ``modname.funcname``, ``modname`` is a module object and ``funcname`` is an attribute of it. In this case there happens to be a straightforward mapping between the module's attributes and the global names defined in the module: they share the same namespace! [#]_
pl: Przy okazji, używam określenia *atrybut* dla dowolnej nazwy występującej po kropce --- na przykład, w wyrażeniu ``z.rzeczywista``, ``rzeczywista`` jest atrybutem obiektu ``z``. Mówiąc ściśle, odwołania do nazw w modułach są odniesieniami do atrybutów: w wyrażeniu ``nazwamodułu.nazwafunkcji``, ``nazwamodułu`` jest obiektem modułu a ``nazwafunkcji`` jest jej atrybutem. W tym przypadku tak się składa, że istnieje bezpośrednie przyporządkowanie pomiędzy atrybutami modułu i nadrzędnymi nazwami zdefiniowanymi wewnątrz modułu: gdyż współdzielą one tę samą przestrzeń nazw! [#]_

source: Attributes may be read-only or writable. In the latter case, assignment to attributes is possible. Module attributes are writable: you can write ``modname.the_answer = 42``. Writable attributes may also be deleted with the :keyword:`del` statement. For example, ``del modname.the_answer`` will remove the attribute :attr:`the_answer` from the object named by ``modname``.
pl: Atrybuty mogą być przeznaczone tylko-do-odczytu lub do odczytu i zapisu. W drugim przypadku, przypisywanie atrybutom wartości jest możliwe. Atrybuty modułu umożliwiją zapis do nich: możesz napisać ``nazwamodułu.odpowiedź = 42``. Atrybuty z możliwością zapisu mogą także zostać skasowane poleceniem :keyword:`del`. Na przykład, ``del nazwamodułu.odpowiedź`` usunie atrybut :attr:`odpowiedź` z obiektu nazwanego jako ``nazwamodułu``.

source: Namespaces are created at different moments and have different lifetimes. The namespace containing the built-in names is created when the Python interpreter starts up, and is never deleted. The global namespace for a module is created when the module definition is read in; normally, module namespaces also last until the interpreter quits. The statements executed by the top-level invocation of the interpreter, either read from a script file or interactively, are considered part of a module called :mod:`__main__`, so they have their own global namespace. (The built-in names actually also live in a module; this is called :mod:`builtins`.)
pl: Przestrzenie nazw są tworzone w różnych momentach i mają różny czas dostępności. Przestrzeń nazw zawierająca nazwy wbudowane jest tworzona gdy program interpretujący język Python jest uruchamiany, i nigdy nie jest usuwana. Nadrzędna przestrzeń nazw dla modułu jest tworzona gdy definicja modułu jest wczytywana; zazwyczaj przestrzenie nazw modułu także utrzymują się aż do zamknięcia programu interpretera języka Python. Wyrażenia wykonywane przez nadrzędne wywołanie programu interpretera, wczytane z pliku skryptu lub w trybie odpowiedzi na polecenia użytkownika, są uznawane jako część modułu zwanego :mod:`__main__`, więc mają swoją nadrzędną przestrzeń nazw. (Nazwy wbudowane w rzeczywistości też są przechowywane w module; ten moduł nazwa się :mod:`builtins`).

source: The local namespace for a function is created when the function is called, and deleted when the function returns or raises an exception that is not handled within the function. (Actually, forgetting would be a better way to describe what actually happens.) Of course, recursive invocations each have their own local namespace.
pl: Wewnętrzne przestrzenie nazw funkcji są tworzone gdy funkcja jest wywoływana, i usuwane gdy sterowanie powraca z funkcji do miejsca wywołania, lub funkcja zgłosi wyjątek który nie jest obsługiwany przez funkcję. (W praktyce, lepszym określeniem na to, co właściwie się dzieje, byłoby zapominanie). Oczywiście, przy odwołaniach cyklicznych (rekurencyjnych) każde wywołanie posiada swoją własną wewnętrzną przestrzeń nazw.

source: A *scope* is a textual region of a Python program where a namespace is directly accessible. "Directly accessible" here means that an unqualified reference to a name attempts to find the name in the namespace.
pl: *Zakres widoczności* jest obszarem tekstu programu w języku Python gdzie przestrzeń nazw jest bezpośrednio dostępna. "Bezpośrednia dostępność" znaczy tu, że niekwalifikowane odwołanie do nazwy próbuje znaleźć nazwę w przestrzeni nazw.

source: Although scopes are determined statically, they are used dynamically. At any time during execution, there are at least three nested scopes whose namespaces are directly accessible:
pl: Chociaż zakresy widoczności są określane statycznie, są one używane dynamicznie. W dowolnym momencie wykonania, istnieją co najmniej trzy zagnieżdżone zakresy widoczności, których przestrzenie nazw są bezpośrednio dostępne:

source: the innermost scope, which is searched first, contains the local names
pl: najbardziej zagnieżdżony zakres widoczności, który jest przeszukiwany w pierwszej kolejności, zawiera nazwy pochodzące z wnętrza funkcji

source: the scopes of any enclosing functions, which are searched starting with the nearest enclosing scope, contains non-local, but also non-global names
pl: zakres widoczności wszelkich otaczających funkcji, które są przeszukiwane poczynając od najbliższego otaczającego zakresu widoczności, zawiera nazwy nie pochodzące z wnętrza funkcji, ale też nie będące nazwami najwyższego rzędu
